html/mapreduce-a-major-step-backwards-ii.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>MapReduce: A major step backwards（MapReduce：一个巨大的倒退）- II</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">MapReduce: A major step backwards（MapReduce：一个巨大的倒退）- II</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. MapReduce is not a database system, so don't judge it as one</a></li>
<li><a href="#sec-2">2. MapReduce has excellent scalability; the proof is Google's use</a></li>
<li><a href="#sec-3">3. MapReduce is cheap and databases are expensive</a></li>
<li><a href="#sec-4">4. We are the old guard trying to defend our turf/legacy from the young turks</a></li>
</ul>
</div>
</div>
<p>
<a href="http://www.pgsqldb.org:8079/mwiki/index.php/MapReduce_II">http://www.pgsqldb.org:8079/mwiki/index.php/MapReduce_II</a>
</p>

<p>
先暂停抱怨几分钟，我们将就上一篇文章的回复中反复出现的特定专题进行一些回答：
</p>
<ul class="org-ul">
<li>MapReduce 不是数据库系统，所以不要以数据库库系统来判断它
</li>
<li>MapReduce 有着杰出的扩展性; 证明就是 Google 的使用
</li>
<li>MapReduce 很便宜，而数据库很昂贵
</li>
<li>我们是老古董，只是想保护自己的领土/财产不受年轻一辈的侵蚀
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> MapReduce is not a database system, so don't judge it as one</h2>
<div class="outline-text-2" id="text-1">
<p>
作者给MapReduce实现上提出了4个建议点，认为可以极大提提升性能，而这些特性在PDBMS里面都有：
</p>
<ul class="org-ul">
<li>Indexing.
</li>
<li>Data movement. computation和data尽量在相同的node上面提高data locality
</li>
<li>Column representation. 减少IO
</li>
<li>Push, not pull. 除去不必要的物化减少IO
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> MapReduce has excellent scalability; the proof is Google's use</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Linear scaleup is the gold standard for measuring the scalability of data intensive applications. As far as we are aware there are no published papers that study the scalability of MapReduce in a controlled scientific fashion. MapReduce may indeed scale linearly, but we have not seen published evidence of this. <b>mapreduce依然没有达到linear scaleup水平</b>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> MapReduce is cheap and databases are expensive</h2>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> We are the old guard trying to defend our turf/legacy from the young turks</h2>
<div class="outline-text-2" id="text-4">
<p>
Since both of us are among the "gray beards" and have been on this earth about 2 Giga-seconds, we have seen a lot of ideas come and go. We are constantly struck by the following two observations: 因为我俩都是“白胡子”老头了，已经在这个地球上呆了超过2G秒了，我们看到过很多主意的产生和消失。而且我们经常被下面两个现象所烦恼：
</p>
<ul class="org-ul">
<li>How insular computer science is. The propagation of ideas from sub-discipline to sub-discipline is very slow and sketchy. Most of us are content to do our own thing, rather than learn what other sub-disciplines have to offer. 计算机科学是多么地孤立。观念从一个子学科传播到另外一个子学科是非常缓慢且残缺的。我们中大多数人都只想做自己的事情，而不是从其它子学科学习已经具备的东西。
</li>
<li>How little knowledge is passed from generation to generation. In a recent paper entitled "What goes around comes around," (M. Stonebraker/J. Hellerstein, Readings in Database Systems 4th edition, MIT Press, 2004) one of us noted that many current database ideas were tried a quarter of a century ago and discarded. However, such pragma does not seem to be passed down from the "gray beards" to the "young turks." The turks and gray beards aren't usually and shouldn't be adversaries. 代与代之间相传的知识是如此之少。在最近的一篇题为“似水流年“（"What goes around comes around," (M. Stonebraker/J. Hellerstein, Readings in Database Systems 4th edition, MIT Press, 2004) ）的文章中，我们中的一个提到了很多现代数据库的观点都曾经在四分之一世纪之前尝试过并被抛弃掉。但是，这些试验仿佛并没有从”白胡子“老头传授给”年轻一辈“。年轻或者年长通常不是也不应该成为对立面。
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
